In [110]:
import numpy as np
import pandas as pd

In [111]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df = pd.DataFrame(dict1)

In [112]:
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [113]:
df.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [114]:
df.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [115]:
r,c = df.shape
print(r)
print(c)

7
3

In [116]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 300.0+ bytes

In [117]:
type(df.Marks[1])

numpy.int64

In [118]:
df.isna().sum(axis = 0)

Name      0
Marks     0
Gender    0
dtype: int64

### Overall Statistics

In [119]:
df.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

### Unique Value

In [120]:
df.Gender.unique()

array(['Male', 'Female'], dtype=object)

In [121]:
df.Marks.unique()

array([98, 89, 99, 87, 90, 83], dtype=int64)

In [122]:
df['Name'].unique()

array(['Priyang', 'Aadhya', 'Krisha', 'Vedant', 'Parshv', 'Mittal',
       'Archana'], dtype=object)

### Value Counts

In [123]:
df['Gender'].value_counts()

Gender
Female    4
Male      3
Name: count, dtype: int64

Find the total number of tudents Having marks between 90 to 100

In [124]:
len(df.loc[(df.Marks >= 90) & (df.Marks <= 100)])

4

In [125]:
df.Marks.between(90,100).sum()

4

Avg Marks

In [126]:
df.Marks.mean()

92.14285714285714

### Apply Method

In [127]:
def by2(x):
    return x/2

In [128]:
df['Half_Marks'] = df.Marks.apply(by2)

In [129]:
df

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [130]:
df.Name.apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### Lambda Func

In [131]:
df.Marks.apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

### Map Function

In [132]:
df
# to conver Male =0 and female to 1

      Name  Marks  Gender  Half_Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [136]:
df['Bin_Gender'] = df.Gender.map(
{
    'Male': 0,
    'Female': 1,
})

In [137]:
df

      Name  Marks  Gender  Half_Marks  Bin_Gender
0  Priyang     98    Male        49.0           0
1   Aadhya     89  Female        44.5           1
2   Krisha     99  Female        49.5           1
3   Vedant     87    Male        43.5           0
4   Parshv     90    Male        45.0           0
5   Mittal     83  Female        41.5           1
6  Archana     99  Female        49.5           1

### Drop the columns

In [138]:
df.drop('Half_Marks',axis = 1)

      Name  Marks  Gender  Bin_Gender
0  Priyang     98    Male           0
1   Aadhya     89  Female           1
2   Krisha     99  Female           1
3   Vedant     87    Male           0
4   Parshv     90    Male           0
5   Mittal     83  Female           1
6  Archana     99  Female           1

In [140]:
df.drop(columns = ['Half_Marks','Bin_Gender'],axis = 1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [148]:
df.drop(columns = df.columns[3:],inplace = True)
df

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### Sorting the DataFrame

In [145]:
df.sort_values(by = ['Marks'],ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

Display name and marks of only female students

In [153]:
df.loc[(df.Gender == "Female") , ['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [154]:
df[df.Gender.isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [156]:
df.Gender.str.contains('Female').sum()

4